package test04;

public class main {
    //Направете абстрактен клас Computer с полета: марка, модел и цена. Направете абстрактен метод printInfo(),
    // който не връща стойност. Направете клас Laptop, който да наследява абстрактния клас Computer.
    // Добавете поле размер на екрана. Методът printInfo() да изпечатва в конзолата информация за всички полета на класа.
    // Направете клас PC, който да наследява абстрактния клас Computer.
    // Добавете поле цвят. Методът printInfo() да изпечатва в конзолата информация за всички полета на класа.
    // В методa main() да се създаде по един обект от класа Laptop и класа PC и да се извикат методите printInfo().
    // За всеки от класовете да се създадат подходящи конструктори и да се спазват принципите за капсулация на данни.
    public static void main(String[] args) {
        Computer laptop = new Laptop("Asus","ROG", 2000, 5.3);
        Computer pc = new PC("Asus","ROG", 2000, "white");

        laptop.printInfo();
        pc.printInfo();

    }


}
